[net]
# Testing
batch=1
subdivisions=1
# Training
# batch=64
# subdivisions=4
# batch=64
# subdivisions=4
width=32
height=96
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

# learning_rate=0.0005  # Instead of 0.001
learning_rate=0.001
burn_in=1000
# max_batches = 500200
max_batches = 520000
policy=steps
# steps=400000,450000
# scales=.1,.1
steps=25000,37250
scales=.1,.1


[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=1

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

###########

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
# filters=155
filters=62
activation=linear



[yolo]
mask = 3,4
# mask = 2,3,4  # Use the last 3 anchors for the first YOLO layer
# mask = 0,1,2,3,4
anchors =  16, 58, 19, 67, 22, 75, 26, 84, 32, 96
classes=26
num=5
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1

[route]
layers = -4

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = -1, 8

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
# filters=155
filters=93
activation=linear

[yolo]
mask = 0,1,2
# mask = 0,1,2  # Use the first 3 anchors for the second YOLO layer
# mask = 0,1,2,3,4
anchors =  16, 58, 19, 67, 22, 75, 26, 84, 32, 96 #20, 49, 30, 54, 51, 35, 34, 62, 84, 39
classes=26
num=5
jitter=.3
ignore_thresh =.7
truth_thresh = 1
random=1
# 0,1,2,3,4
